renesas/ArduinoCore-rl78/variants/g23-fpb-64p/r_mmc_sfr.h
/*----------- PMCTxx register value -----------*/
#define MMC_PMCT0_TBL       (uint8_t)0xF3
/* 11110011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT02   : Set to 0     */
/* ||||++---------- PMCT03   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */

#define MMC_CSI_SIR_CLEAR       (uint8_t)0x03
/* 00000011B */    /* SIRms setting         */
/* |||||||+-------- OVCTmn   : Clear        */
/* ||||||+--------- PECTmn   : Clear        */
/* ++++++---------- Reserved : Set to 0     */

#define MMC_CLK_SO_BITNO        10
#define MMC_DATAO_SO_BITNO      2

#elif (MMC_SAU_CHANNEL == 3)
#define MMC_CSI_UNIT            1
#define MMC_CSI_CHANNEL         1

#define MMC_DATAI_PORTNO        5  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         0  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          3  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           0  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        5  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         1  /* MMC DataOut Bit No.  */

/*----------- PMCTxx register value -----------*/
#define MMC_PMCT3_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT30   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */

/*----------- PMCTxx register value -----------*/
#define MMC_PMCT5_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT50   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */

/*----------- PMCExx register value -----------*/
#define MMC_PMCE5_TBL       (uint8_t)0xFC
/* 11111100B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE50   : Set to 0     */
/* ||||||+--------- PMCE51   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */

/*----------- CCDE register value -----------*/
#define MMC_CCDE_TBL       (uint8_t)0xF3
/* 11110011B */    /* CCDE setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- CCDE02 (P51) : Set to 0 */
/* ||||+----------- CCDE03 (P50) : Set to 0 */
/* ++++------------ Reserved : Set to 1     */

#define MMC_CSI_SIR_CLEAR       (uint8_t)0x07
/* 00000111B */    /* SIRms setting         */
/* |||||||+-------- OVCTmn   : Clear        */
/* ||||||+--------- PECTmn   : Clear        */
/* |||||+---------- FECTmn   : Clear        */
/* +++++----------- Reserved : Set to 0     */

#define MMC_CLK_SO_BITNO        11
#define MMC_DATAO_SO_BITNO      3

#endif  /* #if (MMC_SAU_CHANNEL == x) */

#elif (MMC_SAU_UNIT == 1)
#if (MMC_SAU_CHANNEL == 0)
#define MMC_CSI_UNIT            2
#define MMC_CSI_CHANNEL         0

#define MMC_DATAI_PORTNO        1  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         4  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          1  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           5  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        1  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         3  /* MMC DataOut Bit No.  */

#define MMC_CSI_SIR_CLEAR       (uint8_t)0x03
/* 00000011B */    /* SIRms setting         */
/* |||||||+-------- OVCTmn   : Clear        */
/* ||||||+--------- PECTmn   : Clear        */
/* ++++++---------- Reserved : Set to 0     */

/*----------- PMCAmn register value -----------*/
#define MMC_PMCA1_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCAmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCA13   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */

/*----------- PMCExx register value -----------*/
#define MMC_PMCE1_TBL       (uint8_t)0xC7
/* 11000111B */    /* PMCEmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCE13   : Set to 0     */
/* |||+------------ PMCE14   : Set to 0     */
/* ||+------------- PMCE15   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */

#define MMC_CLK_SO_BITNO        8
#define MMC_DATAO_SO_BITNO      0

#elif (MMC_SAU_CHANNEL == 1)
#define MMC_CSI_UNIT            2
#define MMC_CSI_CHANNEL         1

#define MMC_DATAI_PORTNO        7  /* MMC DataIn Port No.  */
#define MMC_DATAI_BITNO         1  /* MMC DataIn Bit No.   */
#define MMC_CLK_PORTNO          7  /* MMC CLK Port No.     */
#define MMC_CLK_BITNO           0  /* MMC CLK Bit  No.     */
#define MMC_DATAO_PORTNO        7  /* MMC DataOut Port No. */
#define MMC_DATAO_BITNO         2  /* MMC DataOut Bit No.  */

#define MMC_CSI_SIR_CLEAR       (uint8_t)0x07
/* 00000111B */    /* SIRms setting         */
/* |||||||+-------- OVCTmn   : Clear        */
/* ||||||+--------- PECTmn   : Clear        */
/* |||||+---------- FECTmn   : Clear        */
/* +++++----------- Reserved : Set to 0     */

/*----------- PMCTxx register value -----------*/
#define MMC_PMCT7_TBL       (uint8_t)0xF8
/* 11111000B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT70   : Set to 0     */
/* ||||||+--------- PMCT71   : Set to 0     */
/* |||||+---------- PMCT72   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */

#define MMC_CLK_SO_BITNO        9
#define MMC_DATAO_SO_BITNO      1


#endif /* MMC_SAU_CHANNEL */
#endif /* MMC_SAU_UNIT */

/*----------- PMCAxx register value -----------*/
#ifndef MMC_PMCA0_TBL
#define MMC_PMCA0_TBL       (uint8_t)0xFF
#endif /* MMC_PMCA0_TBL */

#ifndef MMC_PMCA1_TBL
#define MMC_PMCA1_TBL       (uint8_t)0xFF
#endif /* MMC_PMCA1_TBL */

#define MMC_PMCA2_TBL       (uint8_t)0xFF
#define MMC_PMCA12_TBL      (uint8_t)0xFF
#define MMC_PMCA14_TBL      (uint8_t)0xFF

/*----------- PMCTxx register value -----------*/
#ifndef MMC_PMCT0_TBL
#define MMC_PMCT0_TBL       (uint8_t)0xFF
#endif /* MMC_PMCT0_TBL */
#ifndef MMC_PMCT3_TBL
#define MMC_PMCT3_TBL       (uint8_t)0xFF
#endif /* MMC_PMCT3_TBL */
#ifndef MMC_PMCT5_TBL
#define MMC_PMCT5_TBL       (uint8_t)0xFF
#endif /* MMC_PMCT5_TBL */
#ifndef MMC_PMCT7_TBL
#define MMC_PMCT7_TBL       (uint8_t)0xFF
#endif /* MMC_PMCT7_TBL */
#define MMC_PMCT2_TBL       (uint8_t)0xFF
#define MMC_PMCT6_TBL       (uint8_t)0xFF

/*----------- PMCExx register value -----------*/
#ifndef MMC_PMCE1_TBL
#define MMC_PMCE1_TBL       (uint8_t)0xFF
#endif /* MMC_PMCE1_TBL */
#ifndef MMC_PMCE5_TBL
#define MMC_PMCE5_TBL       (uint8_t)0xFF
#endif /* MMC_PMCE5_TBL */
#define MMC_PMCE0_TBL       (uint8_t)0xFF
#define MMC_PMCE6_TBL       (uint8_t)0xFF

/*----------- CCDE register value -----------*/
#ifndef MMC_CCDE_TBL
#define MMC_CCDE_TBL       (uint8_t)0xFF
#endif /* MMC_CCDE_TBL */

/*----------- PFOE1 register value -----------*/
#ifndef MMC_PFOE1_TBL
#define MMC_PFOE1_TBL       (uint8_t)0x00
#endif /* MMC_PFOE1_TBL */

/*----------- ISC register value -----------*/
#if (MMC_CSI_UNIT == 0)
#if (MMC_CSI_CHANNEL == 0)
#define MMC_ISC_TBL       (uint8_t)0xE3
/* 11100011B */    /* ISC setting         */
/* ||||||++-------- Reserved : Set to 1   */
/* |||||+---------- ISC2     : Set to 0   */
/* ||||+----------- ISC3     : Set to 0   */
/* |||+------------ ISC4     : Set to 0   */
/* +++------------- Reserved : Set to 1   */
#elif (MMC_CSI_CHANNEL == 1)
#define MMC_ISC_TBL       (uint8_t)0x1F
/* 00011111B */    /* ISC setting         */
/* |||+++++-------- Reserved : Set to 1   */
/* ||+------------- ISC2     : Set to 0   */
/* |+-------------- ISC3     : Set to 0   */
/* +--------------- ISC4     : Set to 0   */
#endif /* MMC_CSI_CHANNEL */
#else
#define MMC_ISC_TBL       (uint8_t)0xFF
#endif /* MMC_CSI_UNIT */

/*----------- PMCAxx (CS0) register value -----------*/
#if (MMC_CS0_PORTNO == 0)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCA0_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCAmn setting         */
/* |||||||+-------- PMCA00   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCA0_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCAmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCA01   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 2)
#define MMC_CS0_PMCA0_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCAmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCA02   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCA0_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCAmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCA03   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 1)
#if (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCA1_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCAmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCA13   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 2)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCAmn setting         */
/* |||||||+-------- PMCA00   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 1)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCAmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCA21   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 2)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCAmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCA22   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 3)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCAmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCA23   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 4)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCAmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCA24   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 5)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCAmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCA25   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 6)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCAmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCA26   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_CS0_BITNO == 7)
#define MMC_CS0_PMCA2_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCAmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCA27   : Set to 0     */
#endif /* MMC_CS0_BITNO */

#elif (MMC_CS0_PORTNO == 12)
#if (MMC_CS0_BITNO == 0)
#define MMC_CS0_PMCA12_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCAmn setting         */
/* |||||||+-------- PMCA120  : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#endif /* MMC_CS0_BITNO */

