renesas/ArduinoCore-rl78/variants/g23-fpb-64p/r_mmc_sfr.h
#elif (MMC_DETECT0_PORTNO == 12)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCA12_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCAmn setting         */
/* |||||||+-------- PMCA120  : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 14)
#if (MMC_DETECT0_BITNO == 7)
#define MMC_DETECT0_PMCA14_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCAmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCA147  : Set to 0     */
#endif /* MMC_DETECT0_BITNO */
#endif /* MMC_DETECT0_PORTNO */

#ifndef MMC_DETECT0_PMCA0_TBL
#define MMC_DETECT0_PMCA0_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCA0_TBL */
#ifndef MMC_DETECT0_PMCA1_TBL
#define MMC_DETECT0_PMCA1_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCA1_TBL */
#ifndef MMC_DETECT0_PMCA2_TBL
#define MMC_DETECT0_PMCA2_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCA2_TBL */
#ifndef MMC_DETECT0_PMCA12_TBL
#define MMC_DETECT0_PMCA12_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCA12_TBL */
#ifndef MMC_DETECT0_PMCA14_TBL
#define MMC_DETECT0_PMCA14_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCA14_TBL */

/*----------- PMCTxx (DETECT0) register value -----------*/
#if (MMC_DETECT0_PORTNO == 0)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT00   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCTmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCT01   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 2)
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT02   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 3)
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT03   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 5)
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT05   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 6)
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT06   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 2)
#if (MMC_DETECT0_BITNO == 2)
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT22   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 3)
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT23   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 4)
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCTmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCT24   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 5)
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT25   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 6)
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT26   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 7)
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0x7F
/* 10111111B */    /* PMCTmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCT27   : Set to 0     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 3)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCT3_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT30   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCT3_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCTmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCT31   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 5)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCT5_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT50   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 6)
#if (MMC_DETECT0_BITNO == 4)
#define MMC_DETECT0_PMCT6_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCTmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCT64   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 5)
#define MMC_DETECT0_PMCT6_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT65   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 6)
#define MMC_DETECT0_PMCT6_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT66   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 7)
#define MMC_DETECT0_PMCT6_TBL       (uint8_t)0x7F
/* 10111111B */    /* PMCTmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCT67   : Set to 0     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 7)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCTmn setting         */
/* |||||||+-------- PMCT70   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCTmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCT71   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 2)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCTmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCT72   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 3)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCTmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCT73   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 4)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCTmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCT74   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 5)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCTmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCT75   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 6)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCTmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCT76   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 7)
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0x7F
/* 10111111B */    /* PMCTmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCT77   : Set to 0     */
#endif /* MMC_DETECT0_BITNO */
#endif /* MMC_DETECT0_PORTNO */

#ifndef MMC_DETECT0_PMCT0_TBL
#define MMC_DETECT0_PMCT0_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCT0_TBL */
#ifndef MMC_DETECT0_PMCT2_TBL
#define MMC_DETECT0_PMCT2_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCT2_TBL */
#ifndef MMC_DETECT0_PMCT3_TBL
#define MMC_DETECT0_PMCT3_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCT3_TBL */
#ifndef MMC_DETECT0_PMCT5_TBL
#define MMC_DETECT0_PMCT5_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCT5_TBL */
#ifndef MMC_DETECT0_PMCT6_TBL
#define MMC_DETECT0_PMCT6_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCT6_TBL */
#ifndef MMC_DETECT0_PMCT7_TBL
#define MMC_DETECT0_PMCT7_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCT7_TBL */

/*----------- PMCExx (DETECT0) register value -----------*/
#if (MMC_DETECT0_PORTNO == 0)
#if (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCE0_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE01   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 1)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE10   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE11   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 2)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xFB
/* 11111011B */    /* PMCEmn setting         */
/* ||||||++-------- Reserved : Set to 1     */
/* |||||+---------- PMCE12   : Set to 0     */
/* +++++----------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 3)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xF7
/* 11110111B */    /* PMCEmn setting         */
/* |||||+++-------- Reserved : Set to 1     */
/* ||||+----------- PMCE13   : Set to 0     */
/* ++++------------ Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 4)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xEF
/* 11101111B */    /* PMCEmn setting         */
/* ||||++++-------- Reserved : Set to 1     */
/* |||+------------ PMCE14   : Set to 0     */
/* +++------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 5)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xDF
/* 11011111B */    /* PMCEmn setting         */
/* |||+++++-------- Reserved : Set to 1     */
/* ||+------------- PMCE15   : Set to 0     */
/* ++-------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 6)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xBF
/* 10111111B */    /* PMCEmn setting         */
/* ||++++++-------- Reserved : Set to 1     */
/* |+-------------- PMCE16   : Set to 0     */
/* +--------------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 7)
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0x7F
/* 01111111B */    /* PMCEmn setting         */
/* |+++++++-------- Reserved : Set to 1     */
/* +--------------- PMCE17   : Set to 0     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 5)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCE5_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE50   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCE5_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE51   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */

#elif (MMC_DETECT0_PORTNO == 6)
#if (MMC_DETECT0_BITNO == 0)
#define MMC_DETECT0_PMCE6_TBL       (uint8_t)0xFE
/* 11111110B */    /* PMCEmn setting         */
/* |||||||+-------- PMCE60   : Set to 0     */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 1)
#define MMC_DETECT0_PMCE6_TBL       (uint8_t)0xFD
/* 11111101B */    /* PMCEmn setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- PMCE61   : Set to 0     */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */
#endif /* MMC_DETECT0_PORTNO */

#ifndef MMC_DETECT0_PMCE0_TBL
#define MMC_DETECT0_PMCE0_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCE0_TBL */
#ifndef MMC_DETECT0_PMCE1_TBL
#define MMC_DETECT0_PMCE1_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCE1_TBL */
#ifndef MMC_DETECT0_PMCE5_TBL
#define MMC_DETECT0_PMCE5_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCE5_TBL */
#ifndef MMC_DETECT0_PMCE6_TBL
#define MMC_DETECT0_PMCE6_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_PMCE6_TBL */

/*----------- CCDE (DETECT0) register value -----------*/
#if (MMC_DETECT0_PORTNO == 1)
#if (MMC_DETECT0_BITNO == 6)
#define MMC_DETECT0_CCDE_TBL       (uint8_t)0xFE
/* 11111110B */    /* CCDE setting         */
/* |||||||+-------- CCDE00 (P16) : Set to 0 */
/* +++++++--------- Reserved : Set to 1     */
#elif (MMC_DETECT0_BITNO == 7)
#define MMC_DETECT0_CCDE_TBL       (uint8_t)0xFD
/* 11111101B */    /* CCDE setting         */
/* |||||||+-------- Reserved : Set to 1     */
/* ||||||+--------- CCDE01 (P17) : Set to 0 */
/* ++++++---------- Reserved : Set to 1     */
#endif /* MMC_DETECT0_BITNO */
#endif /* MMC_DETECT0_PORTNO */

#ifndef MMC_DETECT0_CCDE_TBL
#define MMC_DETECT0_CCDE_TBL       (uint8_t)0xFF
#endif /* MMC_DETECT0_CCDE_TBL */



#define __PM( x,y )              PM ## x ##_bit.no ## y
#define  _PM( x,y )             __PM( x , y )
#define __POM( x,y )            POM ## x ##_bit.no ## y
#define  _POM( x,y )            __POM( x , y )
#define __PIM( x,y )            PIM ## x ##_bit.no ## y
#define  _PIM( x,y )            __PIM( x , y )
#define __P( x,y )              P ## x ##_bit.no ## y
#define  _P( x,y )              __P( x , y )
#define __PMC( x,y )            PMC ## x ##_bit.no ## y
#define  _PMC( x,y )            __PMC( x , y )

#define __SPS( x )              SPS ## x
#define  _SPS( x )              __SPS( x )
#define __SPSL( x )             SPS ## x ## L
#define  _SPSL( x )             __SPSL( x )

