renesas/ArduinoCore-rl78/variants/g23-fpb-64p/r_mmc_sfr.h
#define __SMR( x,y )            SMR ## x ## y
#define  _SMR( x,y )            __SMR( x , y )

#define __SCR( x,y )            SCR ## x ## y
#define  _SCR( x,y )            __SCR( x , y )

#define __SDR( x,y )            SDR ## x ## y
#define  _SDR( x,y )            __SDR( x , y )
#define __SIO( x,y )            SIO ## x ## y
#define  _SIO( x,y )            __SIO( x , y )

#define __SIR( x,y )            SIR ## x ## y
#define  _SIR( x,y )            __SIR( x , y )
#define __SIRL( x,y )           SIR ## x ## y ## L
#define  _SIRL( x,y )           __SIRL( x , y )

#define __SSR( x,y )            SSR ## x ## y
#define  _SSR( x,y )            __SSR( x , y )
#define __SSRL( x,y )           SSR ## x ## y ## L
#define  _SSRL( x,y )           __SSRL( x , y )

#define __SS( x )               SS ## x
#define  _SS( x )               __SS( x )
#define __SSL( x )              SS ## x ## L
#define  _SSL( x )              __SSL( x )
#define __SSLB( x,y )           SS ## x ## L_bit.no ## y
#define  _SSLB( x,y )           __SSLB( x,y )

#define __ST( x )               ST ## x
#define  _ST( x )               __ST( x )
#define __STL( x )              ST ## x ## L
#define  _STL( x )              __STL( x )
#define __STLB( x,y )           ST ## x ## L_bit.no ## y
#define  _STLB( x,y )           __STLB( x,y )

#define __SE( x )               SE ## x
#define  _SE( x )               __SE( x )
#define __SEL( x )              SE ## x ## L
#define  _SEL( x )              __SEL( x )
#define __SELB( x,y )           SE ## x ## L_bit.no ## y
#define  _SELB( x,y )           __SELB( x,y )

#define __SOE( x )              SOE ## x
#define  _SOE( x )              __SOE( x )
#define __SOEL( x )             SOE ## x ## L
#define  _SOEL( x )             __SOEL( x )
#define __SOELB( x,y )          SOE ## x ## L_bit.no ## y
#define  _SOELB( x,y )          __SOELB( x,y )

#define __SO( x )               SO ## x
#define  _SO( x )               __SO( x )

#define __CSIIF( x,y )          CSIIF ## x ## y
#define  _CSIIF( x,y )          __CSIIF( x , y )
#define __CSIMK( x,y )          CSIMK ## x ## y
#define  _CSIMK( x,y )          __CSIMK( x , y )
#define __SAUEN( x )            SAU ## x ## EN
#define  _SAUEN( x )            __SAUEN( x )
#define __SAURES( x )           SAU ## x ## RES
#define  _SAURES( x )           __SAURES( x )

#define MMC_PM_DATAI             _PM( MMC_DATAI_PORTNO , MMC_DATAI_BITNO )     /* MMC DataIn */
#define MMC_PORT_DATAI            _P( MMC_DATAI_PORTNO , MMC_DATAI_BITNO )     /* MMC DataIn */
#define MMC_PIM_DATAI           _PIM( MMC_DATAI_PORTNO , MMC_DATAI_BITNO )     /* MMC DataIn */
#define MMC_POM_DATAI           _POM( MMC_DATAI_PORTNO , MMC_DATAI_BITNO )     /* MMC DataIn */
#define MMC_PMC_DATAI           _PMC( MMC_DATAI_PORTNO , MMC_DATAI_BITNO )     /* MMC DataIn */
#define MMC_PM_CLK               _PM( MMC_CLK_PORTNO , MMC_CLK_BITNO )         /* MMC CLK  */
#define MMC_PORT_CLK              _P( MMC_CLK_PORTNO , MMC_CLK_BITNO )         /* MMC CLK  */
#define MMC_PIM_CLK             _PIM( MMC_CLK_PORTNO , MMC_CLK_BITNO )         /* MMC CLK  */
#define MMC_POM_CLK             _POM( MMC_CLK_PORTNO , MMC_CLK_BITNO )         /* MMC CLK  */
#define MMC_PMC_CLK             _PMC( MMC_CLK_PORTNO , MMC_CLK_BITNO )         /* MMC CLK  */
#define MMC_PM_DATAO             _PM( MMC_DATAO_PORTNO , MMC_DATAO_BITNO )     /* MMC DataOut */
#define MMC_PORT_DATAO            _P( MMC_DATAO_PORTNO , MMC_DATAO_BITNO )     /* MMC DataOut */
#define MMC_PIM_DATAO           _PIM( MMC_DATAO_PORTNO , MMC_DATAO_BITNO )     /* MMC DataOut */
#define MMC_POM_DATAO           _POM( MMC_DATAO_PORTNO , MMC_DATAO_BITNO )     /* MMC DataOut */
#define MMC_PMC_DATAO           _PMC( MMC_DATAO_PORTNO , MMC_DATAO_BITNO )     /* MMC DataOut */

#define MMC_PM_CS0               _PM( MMC_CS0_PORTNO , MMC_CS0_BITNO )         /* MMC CS0 (Negative-true logic) */
#define MMC_PORT_CS0              _P( MMC_CS0_PORTNO , MMC_CS0_BITNO )         /* MMC CS0 (Negative-true logic) */
#define MMC_PIM_CS0             _PIM( MMC_CS0_PORTNO , MMC_CS0_BITNO )         /* MMC CS0 (Negative-true logic) */
#define MMC_POM_CS0             _POM( MMC_CS0_PORTNO , MMC_CS0_BITNO )         /* MMC CS0 (Negative-true logic) */

#if defined(MMC_DETECT0_CONNECTION)
#define MMC_PM_DETECT0           _PM( MMC_DETECT0_PORTNO , MMC_DETECT0_BITNO ) /* MMC Detect0 (Negative-true logic) */
#define MMC_PORT_DETECT0          _P( MMC_DETECT0_PORTNO , MMC_DETECT0_BITNO ) /* MMC Detect0 (Negative-true logic) */
#define MMC_PIM_DETECT0         _PIM( MMC_DETECT0_PORTNO , MMC_DETECT0_BITNO ) /* MMC Detect0 (Negative-true logic) */
#define MMC_POM_DETECT0         _POM( MMC_DETECT0_PORTNO , MMC_DETECT0_BITNO ) /* MMC Detect0 (Negative-true logic) */
#endif /* #if defined(MMC_DETECT0_CONNECTION) */

#if (MMC_SLOT_NUM > 1)
#define MMC_PM_CS1               _PM( MMC_CS1_PORTNO , MMC_CS1_BITNO )         /* MMC CS1 (Negative-true logic) */
#define MMC_PORT_CS1              _P( MMC_CS1_PORTNO , MMC_CS1_BITNO )         /* MMC CS1 (Negative-true logic) */
#define MMC_PIM_CS1             _PIM( MMC_CS1_PORTNO , MMC_CS1_BITNO )         /* MMC CS1 (Negative-true logic) */
#define MMC_POM_CS1             _POM( MMC_CS1_PORTNO , MMC_CS1_BITNO )         /* MMC CS1 (Negative-true logic) */

#if defined(MMC_DETECT1_CONNECTION)
#define MMC_PM_DETECT1           _PM( MMC_DETECT1_PORTNO , MMC_DETECT1_BITNO ) /* MMC Detect1 (Negative-true logic) */
#define MMC_PORT_DETECT1          _P( MMC_DETECT1_PORTNO , MMC_DETECT1_BITNO ) /* MMC Detect1 (Negative-true logic) */
#define MMC_PIM_DETECT1         _PIM( MMC_DETECT1_PORTNO , MMC_DETECT1_BITNO ) /* MMC Detect1 (Negative-true logic) */
#define MMC_POM_DETECT1         _POM( MMC_DETECT1_PORTNO , MMC_DETECT1_BITNO ) /* MMC Detect1 (Negative-true logic) */
#endif /* #if defined(MMC_DETECT1_CONNECTION) */

#endif /* #if (MMC_SLOT_NUM > 1) */


/*----------- Definitions of resource used -----------*/
#define MMC_CSI_USED                             /* CSI used        */
#define MMC_SYNC_MSBF                            /* CSI MSB first      */

#ifdef MMC_OPTION_1
#define MMC_CRC_SOFT                             /* Encode by soft CRC (ROM table used) */
#endif /* #ifdef MMC_OPTION_1 */

