renesas/ArduinoCore-rl78/variants/g23-fpb-64p/r_mmc_sfr.h
#ifdef MMC_OPTION_2
#define MMC_CRC_HARD                             /* Encode by hard CRC     */
#define MMC_CRC_LSBF
#endif /* #ifdef MMC_OPTION_2 */


/*----------------- CSI definitions -----------------*/

/* 16bits 8bits */
#define MMC_CSI_SPSmL           _SPSL( MMC_SAU_UNIT )                   /* SPSmL register  :  8bits */
#define MMC_CSI_SMRmn           _SMR( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )   /* SMRmn register  : 16bits */
#define MMC_CSI_SCRmn           _SCR( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )   /* SCRmn register  : 16bits */
#define MMC_CSI_SDRmn           _SDR( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )   /* SDRmn register  : 16bits */
#define MMC_CSI_SIOmn           _SIO( MMC_CSI_UNIT ,MMC_CSI_CHANNEL )   /* SIOmn register  :  8bits */
#define MMC_CSI_SIRmnL          _SIRL( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )  /* SIRmnL register :  8bits */
#define MMC_CSI_SSRmnL          _SSRL( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )  /* SSRmnL register :  8bits */

#define MMC_CSI_SSmn            _SSLB( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )  /* SSm register Bit n  : 1bit */
#define MMC_CSI_STmn            _STLB( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )  /* STm register Bit n  : 1bit */
#define MMC_CSI_SEmn            _SELB( MMC_SAU_UNIT ,MMC_SAU_CHANNEL )  /* SEm register Bit n  : 1bit */
#define MMC_CSI_SOEmn           _SOELB( MMC_SAU_UNIT ,MMC_SAU_CHANNEL ) /* SOEm register Bit n : 1bit */
#define MMC_CSI_SOm             _SO( MMC_SAU_UNIT )                     /* SOm register        : 16bits */
#define MMC_CSI_ISC             ISC                                     /* ISC register        :  8bits */
#define MMC_CSI_IFmn            _CSIIF( MMC_CSI_UNIT , MMC_CSI_CHANNEL) /* CSI Interrupt flag  :  1bit */
#define MMC_CSI_MKmn            _CSIMK( MMC_CSI_UNIT , MMC_CSI_CHANNEL) /* CSI Interrupt enable flag : 1bit */
#define MMC_SAUmEN              _SAUEN( MMC_SAU_UNIT )                  /* SAU enable flag     :  1bit  */
#define MMC_SAUmRES             _SAURES( MMC_SAU_UNIT )                 /* SAU reset flag      :  1bit  */

#define MMC_CSI_TXBUF           MMC_CSI_SIOmn
#define MMC_CSI_RXBUF           MMC_CSI_SIOmn

#if (MMC_OPERATION_CLK_SELECT == 0)
#define MMC_SPS_MASK            (uint8_t)0xF0
/* xxxx0000B */    /* SPSmnL setting                 */
/* ||||++++-------- PRSm[03:00] : CKm0 = fCLK        */
/* ++++------------ PRSm[07:04] : CKm1 = No change   */
#define MMC_SPS_SET             (uint8_t)(MMC_FCLK_PRESCALER_SELECT)
/* xxxx****B */    /* SPSmnL setting                 */
/* ||||++++-------- PRSm[03:00] : CKm0 set           */
/* ++++------------ PRSm[07:04] : CKm1 = No change   */
#elif (MMC_OPERATION_CLK_SELECT == 1)
#define MMC_SPS_MASK            (uint8_t)0x0F
/* 0000xxxxB */    /* SPSmnL setting                 */
/* ||||++++-------- PRSm[03:00] : CKm0 = No change   */
/* ++++------------ PRSm[07:04] : CKm1 = fCLK        */

#define MMC_SPS_SET             (uint8_t)(MMC_FCLK_PRESCALER_SELECT << 4)
/* ****xxxxB */ /* SPSmnL setting                    */
/* ||||++++-------- PRSm[03:00] : CKm0 = No change   */
/* ++++------------ PRSm[07:04] : CKm1 set           */
#endif

/* CSI setting */
#define MMC_SMR_TX              (uint16_t)0x0021 | ((uint16_t)MMC_OPERATION_CLK_SELECT << 15)
/* 00000000 00100001B */    /* SMRmn setting                                    */
/* |||||||| |||||||+-------- MDmn0      : Buffer empty interrupt                */
/* |||||||| |||||++--------- MDmn[2-1]  : CSI mode                              */
/* |||||||| |||++----------- Reserved   : Set to 0                              */
/* |||||||| ||+------------- Reserved   : Set to 1                              */
/* |||||||| |+-------------- SISmn      : Read by failing edge                  */
/* |||||||| +--------------- Reserved   : Set to 0                              */
/* |||||||+ ---------------- STSmn      : Software trigger is valid             */
/* ||+++++- ---------------- Reserved   : Set to 0                              */
/* |+------ ---------------- CCSmn      : Clock fMCK specified by the CKSmn bit */
/* +------- ---------------- CKSmn      : Operation clock CKmX set by the SPSm  */

#define MMC_SMR_RX              (uint16_t)0x0020 | ((uint16_t)MMC_OPERATION_CLK_SELECT << 15)
/* x0000000 00100000B */    /* SMRmn setting                                    */
/* |||||||| |||||||+-------- MDmn0      : Transfer end interrupt                */
/* |||||||| |||||++--------- MDmn[2-1]  : CSI mode                              */
/* |||||||| |||++----------- Reserved   : Set to 0                              */
/* |||||||| ||+------------- Reserved   : Set to 1                              */
/* |||||||| |+-------------- SISmn      : Read by failing edge                  */
/* |||||||| +--------------- Reserved   : Set to 0                              */
/* |||||||+ ---------------- STSmn      : Software trigger is valid             */
/* ||+++++- ---------------- Reserved   : Set to 0                              */
/* |+------ ---------------- CCSmn      : Clock fMCK specified by the CKSmn bit */
/* +------- ---------------- CKSmn      : Operation clock CKmX set by user      */

#define MMC_SCR_INIT            (uint16_t)0x0007
/* 00000000 00000111B */    /* SCRmn setting                                    */
/* |||||||| ||||||++-------- DLSmn[1:0] : 8-bit data length                     */
/* |||||||| |||||+---------- Reserved   : Set to 1                              */
/* |||||||| ||||+----------- Reserved   : Set to 0                              */
/* |||||||| ||++------------ SLCmn[1:0] : No stop bit                           */
/* |||||||| |+-------------- Reserved   : Set to 0                              */
/* |||||||| +--------------- DIRmn      : MSB first                             */
/* ||||||++ ---------------- PTCmn[1:0] : Receives without parity               */
/* |||||+-- ---------------- EOCmn      : Masks error interrupt                 */
/* ||||+--- ---------------- Reserved   : Set to 0                              */
/* |||+---- ---------------- CKPmn      : Select type 1                         */
/* ||+----- ---------------- DAPmn      : Select type 1                         */
/* |+------ ---------------- RXEmn      : Disable Reception                     */
/* +------- ---------------- TXEmn      : Disable Transmission                  */

#define MMC_SCR_TX              (uint16_t)0x8007
/* 10000000 00000111B */    /* SCRmn setting                                    */
/* |||||||| ||||||++-------- DLSmn[1:0] : 8-bit data length                     */
/* |||||||| |||||+---------- Reserved   : Set to 1                              */
/* |||||||| ||||+----------- Reserved   : Set to 0                              */
/* |||||||| ||++------------ SLCmn[1:0] : No stop bit                           */
/* |||||||| |+-------------- Reserved   : Set to 0                              */
/* |||||||| +--------------- DIRmn      : MSB first                             */
/* ||||||++ ---------------- PTCmn[1:0] : Receives without parity               */
/* |||||+-- ---------------- EOCmn      : Masks error interrupt                 */
/* ||||+--- ---------------- Reserved   : Set to 0                              */
/* |||+---- ---------------- CKPmn      : Select type 1                         */
/* ||+----- ---------------- DAPmn      : Select type 1                         */
/* |+------ ---------------- RXEmn      : Disable Reception                     */
/* +------- ---------------- TXEmn      : Enable Transmission                   */

#define MMC_SCR_RX              (uint16_t)0x4007
/* 10000000 00000111B */    /* SCRmn setting                                    */
/* |||||||| ||||||++-------- DLSmn[1:0] : 8-bit data length                     */
/* |||||||| |||||+---------- Reserved   : Set to 1                              */
/* |||||||| ||||+----------- Reserved   : Set to 0                              */
/* |||||||| ||++------------ SLCmn[1:0] : No stop bit                           */
/* |||||||| |+-------------- Reserved   : Set to 0                              */
/* |||||||| +--------------- DIRmn      : MSB first                             */
/* ||||||++ ---------------- PTCmn[1:0] : Receives without parity               */
/* |||||+-- ---------------- EOCmn      : Masks error interrupt                 */
/* ||||+--- ---------------- Reserved   : Set to 0                              */
/* |||+---- ---------------- CKPmn      : Select type 1                         */
/* ||+----- ---------------- DAPmn      : Select type 1                         */
/* |+------ ---------------- RXEmn      : Enable Reception                      */
/* +------- ---------------- TXEmn      : Disable Transmission                  */

