renesas/ArduinoCore-rl78/variants/g23-fpb-64p/r_mmc_sfr.h
#define MMC_CLKOUT_BIT          (uint16_t)(0x0001 << (8 + MMC_SAU_CHANNEL))
/* 0000xxxx 00000000B */    /* SOmn setting                                     */
/* |||||||| ++++++++-------- Reserved   : Set to 0                              */
/* |||||||+ ---------------- CKOm0      : CKOm0 Output level                    */
/* ||||||+- ---------------- CKOm1      : CKOm1 Output level                    */
/* |||||+-- ---------------- CKOm2      : CKOm2 Output level                    */
/* ||||+--- ---------------- CKOm3      : CKOm3 Output level                    */
/* ++++---- ---------------- Reserved   : Set to 0                              */

#define MMC_SOOUT_BIT           (uint16_t)(0x0001 << (MMC_SAU_CHANNEL))
/* 00000000 0000xxxxB */    /* SOmn setting                                     */
/* |||||||| |||||||+-------- SOm0       : SOm0 Output level                     */
/* |||||||| ||||||+--------- SOm1       : SOm1 Output level                     */
/* |||||||| |||||+---------- SOm2       : SOm2 Output level                     */
/* |||||||| ||||+----------- SOm3       : SOm3 Output level                     */
/* ++++++++ ++++------------ Reserved   : Set to 0                              */

#define MMC_TXNEXT_MASK         (uint8_t)(0x20)
/* 00100000B */    /* SSRmn reading           */
/* |||||||+-------- OVFmn     : Not Check     */
/* ||||||+--------- PEFmn     : Not Check     */
/* |||||+---------- FEFmn     : Not Check     */
/* |||++----------- Reserved  : Not Check     */
/* ||+------------- BFFmn     : Check         */
/* |+-------------- TSFmn     : Not Check     */
/* +--------------- Reserved  : Not Check     */

#define MMC_TXEND_MASK          (uint8_t)(0x40)
/* 01000000B */    /* SSRmn reading       */
/* |||||||+-------- OVFmn     : Not Check     */
/* ||||||+--------- PEFmn     : Not Check     */
/* |||||+---------- FEFmn     : Not Check     */
/* |||++----------- Reserved  : Not Check     */
/* ||+------------- BFFmn     : Not Check     */
/* |+-------------- TSFmn     : Check         */
/* +--------------- Reserved  : Not Check     */

#define MMC_RX_COMPLETE_MASK    (uint8_t)(0x20)
/* 01000000B */    /* SSRmn reading           */
/* |||||||+-------- OVFmn     : Not Check     */
/* ||||||+--------- PEFmn     : Not Check     */
/* |||||+---------- FEFmn     : Not Check     */
/* |||++----------- Reserved  : Not Check     */
/* ||+------------- BFFmn     : Check         */
/* |+-------------- TSFmn     : Not Check     */
/* +--------------- Reserved  : Not Check     */

#define MMC_OVF_MASK            (uint8_t)(0x01)
/* 00000001B */    /* SSRmn reading           */
/* |||||||+-------- OVFmn     : Not Check     */
/* ||||||+--------- PEFmn     : Not Check     */
/* |||||+---------- FEFmn     : Not Check     */
/* |||++----------- Reserved  : Not Check     */
/* ||+------------- BFFmn     : Not Check     */
/* |+-------------- TSFmn     : Check         */
/* +--------------- Reserved  : Not Check     */


#define MMC_DUMMY_DATA          (uint8_t)0xFF    /* MMC dummy data for some command */

/*----------------- CRC definitions ------------------*/
#ifdef MMC_CRC_HARD
#define MMC_CRCIN               CRCIN            /* CRC input register     */
#define MMC_CRCD                CRCD             /* CRC data register      */

#endif /* #ifdef MMC_CRC_HARD */


/************************************************************************************************/
/* Unions                                                                                       */
/************************************************************************************************/

/************************************************************************************************/
/* Structs                                                                                      */
/************************************************************************************************/

/************************************************************************************************/
/* Externs                                                                                      */
/************************************************************************************************/

/************************************************************************************************/
/* Macros                                                                                       */
/************************************************************************************************/

/*------------- Driver use port control --------------*/
#if (MMC_SLOT_NUM == 1)
/* !!!! The other Ports are set to input mode. !!!! */
#define MMC_IO_INIT()           do               /* Driver use terminal initial setting         */ \
    {                                                                                              \
        PMCA0          &= (MMC_PMCA0_TBL & MMC_CS0_PMCA0_TBL & MMC_DETECT0_PMCA0_TBL); \
        PMCA1          &= (MMC_PMCA1_TBL & MMC_CS0_PMCA1_TBL & MMC_DETECT0_PMCA1_TBL); \
        PMCA2          &= (MMC_PMCA2_TBL & MMC_CS0_PMCA2_TBL & MMC_DETECT0_PMCA2_TBL); \
        PMCA12         &= (MMC_PMCA12_TBL & MMC_CS0_PMCA12_TBL & MMC_DETECT0_PMCA12_TBL); \
        PMCA14         &= (MMC_PMCA14_TBL & MMC_CS0_PMCA14_TBL & MMC_DETECT0_PMCA14_TBL); \
        PMCT0          &= (MMC_PMCT0_TBL & MMC_CS0_PMCT0_TBL & MMC_DETECT0_PMCT0_TBL); \
        PMCT2          &= (MMC_PMCT2_TBL & MMC_CS0_PMCT2_TBL & MMC_DETECT0_PMCT2_TBL); \
        PMCT3          &= (MMC_PMCT3_TBL & MMC_CS0_PMCT3_TBL & MMC_DETECT0_PMCT3_TBL); \
        PMCT5          &= (MMC_PMCT5_TBL & MMC_CS0_PMCT5_TBL & MMC_DETECT0_PMCT5_TBL); \
        PMCT6          &= (MMC_PMCT6_TBL & MMC_CS0_PMCT6_TBL & MMC_DETECT0_PMCT6_TBL); \
        PMCT7          &= (MMC_PMCT7_TBL & MMC_CS0_PMCT7_TBL & MMC_DETECT0_PMCT7_TBL); \
        PMCE0          &= (MMC_PMCE0_TBL & MMC_CS0_PMCE0_TBL & MMC_DETECT0_PMCE0_TBL); \
        PMCE1          &= (MMC_PMCE1_TBL & MMC_CS0_PMCE1_TBL & MMC_DETECT0_PMCE1_TBL); \
        PMCE5          &= (MMC_PMCE5_TBL & MMC_CS0_PMCE5_TBL & MMC_DETECT0_PMCE5_TBL); \
        PMCE6          &= (MMC_PMCE6_TBL & MMC_CS0_PMCE6_TBL & MMC_DETECT0_PMCE6_TBL); \
        CCDE           &= (MMC_CCDE_TBL & MMC_CS0_CCDE_TBL & MMC_DETECT0_CCDE_TBL); \
        PFOE1          |= MMC_PFOE1_TBL; \
        MMC_PORT_DATAO = MMC_TRUE;               /* DataOut   "H"                               */ \
        MMC_PM_DATAO   = MMC_FALSE;              /* DataOut   Output                            */ \
        MMC_PORT_CLK   = MMC_TRUE;               /* CLK       "H"                               */ \
        MMC_PM_CLK     = MMC_FALSE;              /* CLK       Output                            */ \
        MMC_PM_DATAI   = MMC_TRUE;               /* DataIn    Input                             */ \
        MMC_PORT_CS0   = MMC_TRUE;               /* CS0       "H"                               */ \
        MMC_PM_CS0     = MMC_FALSE;              /* CS0       Output                            */ \
        MMC_DETECT0_INIT();                      /* DETECT0   Input                             */ \
    } while (0)
#endif /* #if (MMC_SLOT_NUM == 1) */

#if (MMC_SLOT_NUM > 1)
/* !!!! The other Ports are set to input mode. !!!! */
#define MMC_IO_INIT()           do               /* Driver use terminal initial setting         */ \
    {                                                                                              \
        PMCA0          &= (MMC_PMCA0_TBL & MMC_CS0_PMCA0_TBL & MMC_DETECT0_PMCA0_TBL); \
        PMCA1          &= (MMC_PMCA1_TBL & MMC_CS0_PMCA1_TBL & MMC_DETECT0_PMCA1_TBL); \
        PMCA2          &= (MMC_PMCA2_TBL & MMC_CS0_PMCA2_TBL & MMC_DETECT0_PMCA2_TBL); \
        PMCA12         &= (MMC_PMCA12_TBL & MMC_CS0_PMCA12_TBL & MMC_DETECT0_PMCA12_TBL); \
        PMCA14         &= (MMC_PMCA14_TBL & MMC_CS0_PMCA14_TBL & MMC_DETECT0_PMCA14_TBL); \
        PMCT0          &= (MMC_PMCT0_TBL & MMC_CS0_PMCT0_TBL & MMC_DETECT0_PMCT0_TBL); \
        PMCT2          &= (MMC_PMCT2_TBL & MMC_CS0_PMCT2_TBL & MMC_DETECT0_PMCT2_TBL); \
        PMCT3          &= (MMC_PMCT3_TBL & MMC_CS0_PMCT3_TBL & MMC_DETECT0_PMCT3_TBL); \
        PMCT5          &= (MMC_PMCT5_TBL & MMC_CS0_PMCT5_TBL & MMC_DETECT0_PMCT5_TBL); \
        PMCT6          &= (MMC_PMCT6_TBL & MMC_CS0_PMCT6_TBL & MMC_DETECT0_PMCT6_TBL); \
        PMCT7          &= (MMC_PMCT7_TBL & MMC_CS0_PMCT7_TBL & MMC_DETECT0_PMCT7_TBL); \
        PMCE0          &= (MMC_PMCE0_TBL & MMC_CS0_PMCE0_TBL & MMC_DETECT0_PMCE0_TBL); \
        PMCE1          &= (MMC_PMCE1_TBL & MMC_CS0_PMCE1_TBL & MMC_DETECT0_PMCE1_TBL); \
        PMCE5          &= (MMC_PMCE5_TBL & MMC_CS0_PMCE5_TBL & MMC_DETECT0_PMCE5_TBL); \
        PMCE6          &= (MMC_PMCE6_TBL & MMC_CS0_PMCE6_TBL & MMC_DETECT0_PMCE6_TBL); \
        CCDE           &= (MMC_CCDE_TBL & MMC_CS0_CCDE_TBL & MMC_DETECT0_CCDE_TBL); \
        PFOE1          |= MMC_PFOE1_TBL; \
        MMC_PORT_DATAO = MMC_TRUE;               /* DataOut   "H"                               */ \
        MMC_PM_DATAO   = MMC_FALSE;              /* DataOut   Output                            */ \
        MMC_PORT_CLK   = MMC_TRUE;               /* CLK       "H"                               */ \
        MMC_PM_CLK     = MMC_FALSE;              /* CLK       Output                            */ \
        MMC_PM_DATAI   = MMC_TRUE;               /* DataIn    Input                             */ \
        MMC_PORT_CS0   = MMC_TRUE;               /* CS0       "H"                               */ \
        MMC_PM_CS0     = MMC_FALSE;              /* CS0       Output                            */ \
        MMC_DETECT0_INIT();                      /* DETECT0   Input                             */ \
        MMC_PORT_CS1   = MMC_TRUE;               /* CS1       "H"                               */ \
        MMC_PM_CS1     = MMC_FALSE;              /* CS1       Output                            */ \
        MMC_DETECT1_INIT();                      /* DETECT1   Input                             */ \
    } while (0)
#endif /* #if (MMC_SLOT_NUM > 1) */

/*------------------ DataIn control ------------------*/
#define MMC_DATAI_INIT()        do               /* DataIn initial setting                      */ \
    {                                                                                              \
    } while (0)

