renesas/ArduinoCore-rl78/variants/g23-fpb-64p/r_mmc_sfr.h
#define MMC_CSI_DI()            do               /* CSI disable setting                         */ \
    {                                                                                              \
        MMC_CSI_SCRmn   = MMC_SCR_INIT;          /* init SCR setting                            */ \
    } while (0)

#define MMC_CSI_BRG_SET(BR_DATA) do              /* CSI bit rate setting                        */ \
    {                                                                                              \
        MMC_CSI_SDRmn   = ((uint16_t)BR_DATA << 9);  /* Clock setting                           */ \
    } while (0)

#define MMC_CSI_TX_EI()         do               /* CSI transmit enable setting                 */ \
    {                                                                                              \
        MMC_CSI_SMRmn   = MMC_SMR_TX;            /* Transmission mode setting                   */ \
        MMC_CSI_SCRmn   = MMC_SCR_TX;            /* Transmission mode setting                   */ \
        MMC_CSI_SOEmn   = MMC_TRUE;                                                                \
        MMC_CSI_IFmn    = MMC_FALSE;             /* clear INTCSImn interrupt flag               */ \
        MMC_CSI_SSmn    = MMC_TRUE;              /* enable CSIxy                                */ \
    } while (0)

#define MMC_CSI_TRX_EI()        do               /* CSI transmit&receive enable setting         */ \
    {                                                                                              \
        MMC_CSI_SMRmn   = MMC_SMR_RX;            /* Transmission mode setting                   */ \
        MMC_CSI_SCRmn   = MMC_SCR_RX;            /* Transmission mode setting                   */ \
        MMC_CSI_SOEmn   = MMC_TRUE;              /* enable CSI                                  */ \
        MMC_CSI_IFmn    = MMC_FALSE;             /* clear INTCSImn interrupt flag               */ \
        MMC_CSI_SSmn    = MMC_TRUE;              /* start CSI                                   */ \
    } while (0)

#define MMC_CSI_TX_DI()         do               /* CSI transmit disable setting                */ \
    {                                                                                              \
        MMC_CSI_STmn    = MMC_TRUE;              /* stop CSI                                    */ \
        MMC_CSI_SOEmn   = MMC_FALSE;             /* disable CSI output                          */ \
        MMC_CSI_IFmn    = MMC_FALSE;             /* clear INTCSImn interrupt flag               */ \
        MMC_CSI_SOm    |= ((uint16_t)1 << MMC_CLK_SO_BITNO) | ((uint16_t)1 << MMC_DATAO_SO_BITNO);             /* Port init    */ \
    } while (0)

#define MMC_CSI_TRX_DI()        do              /* CSI transmit&receive disable setting         */ \
    {                                                                                              \
        MMC_CSI_STmn    = MMC_TRUE;             /* stop CSI                                     */ \
        MMC_CSI_SOEmn   = MMC_FALSE;            /* disable CSI output                           */ \
        MMC_CSI_IFmn    = MMC_FALSE;            /* clear INTCSImn interrupt flag                */ \
        MMC_CSI_SOm    |= ((uint16_t)1 << MMC_CLK_SO_BITNO) | ((uint16_t)1 << MMC_DATAO_SO_BITNO);             /* Port init    */ \
    } while (0)

#define MMC_TXNEXT_CHECK()      ((MMC_CSI_SSRmnL & MMC_TXNEXT_MASK) != 0)
#define MMC_TXNEXT_CLR()        do                                                                 \
    {                                                                                              \
        MMC_CSI_IFmn  = MMC_FALSE;                                                                 \
    } while (0)

#define MMC_TXEND_CHECK()       ((MMC_CSI_SSRmnL & MMC_TXEND_MASK) != 0)


#define MMC_CSI_ORER_CHECK()    ((MMC_CSI_SSRmnL & MMC_OVF_MASK) != 0)

#define MMC_RX_COMPLETE_CHECK() ((MMC_CSI_SSRmnL & MMC_RX_COMPLETE_MASK) == 0)
#define MMC_RXNEXT_CLR()

/*----------------- CRC calculation ------------------*/
#ifdef MMC_CRC_HARD
#define MMC_CRC_CLR()           MMC_CRCD  = 0x0000
#define MMC_CRC_SET(Data)       do                                                                 \
    {                                                                                              \
        MMC_CRCIN = T_ExchgBit[Data];                                                              \
    }while(0);

#define MMC_CRC_GET(Data)       Data = MMC_CRCD
#else /* #ifdef MMC_CRC_HARD */
#define MMC_CRC_CLR()           gMmc_CrcData.us = 0x0000
#ifdef MTL_MCU_LITTLE
#define MMC_CRC_SET(Data)       do                                                                 \
    {                                                                                              \
        uint8_t ucTmp;                                                                             \
        ucTmp              = gMmc_CrcData.uc[0];                                                   \
        gMmc_CrcData.us    = T_Crc_Ccitt[gMmc_CrcData.uc[1] ^ Data];                               \
        gMmc_CrcData.uc[1] = gMmc_CrcData.uc[1] ^ ucTmp;                                           \
    } while (0)
#else /* #ifdef MTL_MCU_LITTLE */
#define MMC_CRC_SET(Data)       do                                                                 \
    {                                                                                              \
        uint8_t ucTmp;                                                                             \
        ucTmp              = gMmc_CrcData.uc[1];                                                   \
        gMmc_CrcData.us    = T_Crc_Ccitt[gMmc_CrcData.uc[0] ^ Data];                               \
        gMmc_CrcData.uc[0] = gMmc_CrcData.uc[0] ^ ucTmp;                                           \
    } while (0)
#endif /* #ifdef MTL_MCU_LITTLE */
#define MMC_CRC_GET(Data)       Data = gMmc_CrcData.us
#endif /* #ifdef MMC_CRC_HARD */

#endif /* __MMC_SFR_H__ */
